//============================================================
//
//	ポーズヘッダー [pause.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _PAUSE_H_
#define _PAUSE_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include "main.h"
#include "object.h"

//************************************************************
//	前方宣言
//************************************************************
class CObject2D;	// オブジェクト2Dクラス

//************************************************************
//	クラス定義
//************************************************************
// ポーズクラス
class CPause
{
public:
	// コンストラクタ
	CPause();

	// デストラクタ
	~CPause();

	// オーバーライド関数
	HRESULT Init(void);	// 初期化
	void Uninit(void);	// 終了
	void Update(void);	// 更新
	void Draw(void);	// 描画
	void SetEnableDraw(const bool bDraw);	// 描画状況設定

	// 静的メンバ関数
	static CPause *Create(void);				// 生成
	static HRESULT Release(CPause *&prPause);	// 破棄

	// メンバ関数
	bool IsPause(void);	// ポーズ状況取得

private:
	// メンバ変数
	CObject2D *m_pTitle;	// タイトル情報
	bool m_bPause;	// ポーズ状況
};

#endif	// _PAUSE_H_
