//============================================================
//
//	タイトル画面ヘッダー [sceneTitle.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _SCENE_TITLE_H_
#define _SCENE_TITLE_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include "main.h"
#include "scene.h"

//************************************************************
//	クラス定義
//************************************************************
// タイトル画面クラス
class CSceneTitle : public CScene
{
public:
	// コンストラクタ
	CSceneTitle();

	// デストラクタ
	~CSceneTitle();

	// オーバーライド関数
	HRESULT Init(void) override;	// 初期化
	HRESULT Uninit(void) override;	// 終了
	void Update(void) override;		// 更新
	void Draw(void) override;		// 描画

private:
};

#endif	// _SCENE_TITLE_H_
