//============================================================
//
//	ショップ処理 [shop.cpp]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	インクルードファイル
//************************************************************
#include "shop.h"
#include "manager.h"
#include "renderer.h"
#include "anim2D.h"
#include "valueUI.h"

//************************************************************
//	マクロ定義
//************************************************************
#define PTRN_WIDTH	(BUY_MAX)	// テクスチャの横分割数
#define PTRN_HEIGHT	(1)			// テクスチャの縦分割数

//************************************************************
//	子クラス [CShop] のメンバ関数
//************************************************************
//============================================================
//	コンストラクタ
//============================================================
CShop::CShop() : CObject(CObject::LABEL_NONE, DEFAULT_PRIO)
{
	// メンバ変数をクリア
	m_pIcon = NULL;			// 購入品アイコン
	m_pLife = NULL;			// 必要体力
	m_pLv = NULL;			// 必要レベル
	m_buy = BUY_LV1_FIRE;	// 購入品
}

//============================================================
//	デストラクタ
//============================================================
CShop::~CShop()
{

}

//============================================================
//	初期化処理
//============================================================
HRESULT CShop::Init(void)
{
	// メンバ変数を初期化
	m_pIcon = NULL;			// 購入品アイコン
	m_pLife = NULL;			// 必要体力
	m_pLv = NULL;			// 必要レベル
	m_buy = BUY_LV1_FIRE;	// 購入品

	// TODO：ここに生成処理

	// 購入品アイコンの生成
	m_pIcon = CAnim2D::Create
	( // 引数
		PTRN_WIDTH,		// 横分割数
		PTRN_HEIGHT,	// 縦分割数
		VEC3_ZERO		// 位置
	);
	if (UNUSED(m_pIcon))
	{ // 非使用中の場合

		// 失敗を返す
		assert(false);
		return E_FAIL;
	}

	// パターンを設定
	m_pIcon->SetPattern(m_buy);

	// 成功を返す
	return S_OK;
}

//============================================================
//	終了処理
//============================================================
void CShop::Uninit(void)
{
	// TODO：ここに破棄処理

	// 自身のオブジェクトを破棄
	Release();
}

//============================================================
//	更新処理
//============================================================
void CShop::Update(void)
{

}

//============================================================
//	描画処理
//============================================================
void CShop::Draw(void)
{

}

//============================================================
//	生成処理
//============================================================
CShop *CShop::Create
(
	const BUY buy,			// 購入品
	const D3DXVECTOR3& rPos	// 位置
)
{
	// ポインタを宣言
	CShop *pShop = NULL;		// ショップ生成用

	if (UNUSED(pShop))
	{ // 使用されていない場合

		// メモリ確保
		pShop = new CShop;	// ショップ
	}
	else { assert(false); return NULL; }	// 使用中

	if (USED(pShop))
	{ // 確保に成功している場合

		// ショップの初期化
		if (FAILED(pShop->Init()))
		{ // 初期化に失敗した場合

			// メモリ開放
			delete pShop;
			pShop = NULL;

			// 失敗を返す
			return NULL;
		}

		// 確保したアドレスを返す
		return pShop;
	}
	else { assert(false); return NULL; }	// 確保失敗
}

//============================================================
//	設定処理
//============================================================
void CShop::Set(const BUY buy)
{
	// 引数の購入品を設定
	m_buy = buy;
}

//============================================================
//	取得処理
//============================================================
CShop::BUY CShop::Get(void)
{
	// 購入品を返す
	return m_buy;
}
