//============================================================
//
//	数字UIヘッダー [valueUI.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _VALUE_UI_H_
#define _VALUE_UI_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include "main.h"
#include "object.h"

//************************************************************
//	前方宣言
//************************************************************
class CObject2D;	// オブジェクト2Dクラス
class CMultiValue;	// マルチ数字クラス

//************************************************************
//	クラス定義
//************************************************************
// 数字UIクラス
class CValueUI : public CObject
{
public:
	// コンストラクタ
	CValueUI();

	// デストラクタ
	~CValueUI();

	// オーバーライド関数
	HRESULT Init(void);	// 初期化
	void Uninit(void);	// 終了
	void Update(void);	// 更新
	void Draw(void);	// 描画

	// 静的メンバ関数
	static CValueUI *Create(const D3DXVECTOR3& rPos);	// 生成

private:
	// メンバ変数
	CObject2D *m_pTitle;	// タイトル情報
	CMultiValue *m_pValue;	// 数字情報
	D3DXVECTOR3 m_pos;		// 位置

	// TODO
};

#endif	// _VALUE_UI_H_
