//============================================================
//
//	エディットヘッダー [edit.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _EDIT_H_
#define _EDIT_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include "main.h"

//************************************************************
//	クラス定義
//************************************************************
// エディットクラス
class CEdit
{
public:
	// コンストラクタ
	CEdit();

	// デストラクタ
	~CEdit();

	// メンバ関数
	HRESULT Init(void);	// 初期化
	void Uninit(void);	// 終了
	void Update(void);	// 更新

	// 静的メンバ関数
	static CEdit *Create(void);				// 生成
	static HRESULT Release(CEdit *&prEdit);	// 破棄

private:

};

#endif	// _EDIT_H_
