//============================================================
//
//	チュートリアルプレイヤーヘッダー [playerTutorial.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _PLAYER_TUTORIAL_H_
#define _PLAYER_TUTORIAL_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include "main.h"
#include "player.h"

//************************************************************
//	クラス定義
//************************************************************
// チュートリアルプレイヤークラス
class CPlayerTutorial : public CPlayer
{
public:
	// コンストラクタ
	CPlayerTutorial();

	// デストラクタ
	~CPlayerTutorial();

	// オーバーライド関数
	HRESULT Init(void);	// 初期化
	void Uninit(void);	// 終了
	void Update(void);	// 更新

private:

};

#endif	// _PLAYER_TUTORIAL_H_
